"""
题目描述
输入一个整数，输出该数二进制表示中1的个数。其中负数用补码表示。
"""

"""
1的原码  0000 0000 0000 0001      正数的原码、反码、补码都是一样的
 
-1的原码 1000 0000 0000 0001      
 
-1的反码 1111 1111 1111 1110
 
-1的补码 1111 1111 1111 1111
 
-1 + 1 =  0000 0000 0000 0000 即 0
 
-1 +1就是-1的补码+1的补码 即为0

"""

# -*- coding:utf-8 -*-
class Solution:
    def NumberOf1(self, n):
        # write code here
        c = 0
        if n<0:
            n = n&0xffffffff  # 可以得到补码
        while n:
            c += 1
            n &= n-1
        return c


print(-1212&0xffffffff)